app/Controllers/usuario.php

    public function index() //o método index serve para listar todos os usuários cadastrador
    {
        $model = new UsuarioModel(); //instancia a model
        $data['usuario'] = $model->findAll() ; // o array $data carrega os dados para a view usuarios/index,php (pega todos os usuarios) e o findAll() retorna todos os dados da tabela
---
SELECT *
FROM `Usuario`

    public function listaUsuario()
{
    $model = new UsuarioModel();

  $usuarioModel = new UsuarioModel();

        // Pega 5 usuários por página
        $data['usuarios'] = $usuarioModel->paginate(5, 'usuarios' );
---
SELECT *
FROM `usuario`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `usuario`

    public function edit($id){//método para exibir o formulário de edição

        $model = new UsuarioModel();
        $data['usuario'] = $model->find($id); //busca o usuário pelo id
---
SELECT *
FROM `Usuario`
WHERE `Usuario`.`id` = '103'

public function autenticar()
{
    $email = $this->request->getPost('email');
    $senha = $this->request->getPost('senha');
    $model = new UsuarioModel();
    $usuario = $model->where('email', $email)->first();
---
SELECT *
FROM `usuario`
WHERE `email` = 'sarah@gmail.com'
 LIMIT 1

public function bemVindo() //o método index serve para listar todos os usuários cadastrador
    {
        $model = new UsuarioModel(); //instancia a model
        $data['usuario'] = $model->findAll() ; // o array $data carrega os dados para a view usuarios/index,php (pega todos os usuarios) e o findAll() retorna todos os dados da tabela
---
SELECT *
FROM `usuario`